; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	Star5 - direction
	Star9 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation13 - direction
	Star7 - direction
	GroundStation0 - direction
	Star11 - direction
	GroundStation10 - direction
	Star14 - direction
	GroundStation1 - direction
	GroundStation12 - direction
	GroundStation2 - direction
	GroundStation8 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation12)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star14)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star11)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star11)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 GroundStation13)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation12)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation12)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star14)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation10)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite2 GroundStation10)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Star17 image1)
	(have_image Star18 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation13 groundstation12)
   deleted: (pointing satellite3 groundstation12)
   added: (pointing satellite3 groundstation13)
   goals met: 1 of 6
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 6
3. (calibrate satellite3 instrument5 groundstation13)
   added: (calibrated instrument5)
   goals met: 1 of 6
4. (turn_to satellite3 phenomenon16 groundstation13)
   deleted: (pointing satellite3 groundstation13)
   added: (pointing satellite3 phenomenon16)
   goals met: 1 of 6
5. (turn_to satellite2 groundstation10 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 groundstation10)
   goals met: 2 of 6
6. (take_image satellite3 phenomenon16 instrument5 image2)
   added: (have_image phenomenon16 image2)
   goals met: 3 of 6
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 6
8. (calibrate satellite1 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 3 of 6
9. (turn_to satellite1 phenomenon15 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 6
10. (take_image satellite1 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 4 of 6
11. (turn_to satellite1 star17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star17)
   goals met: 4 of 6
12. (take_image satellite1 star17 instrument1 image1)
   added: (have_image star17 image1)
   goals met: 5 of 6
13. (turn_to satellite1 star18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star18)
   goals met: 5 of 6
14. (take_image satellite1 star18 instrument1 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 6 of 6
